; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared3 - mode
	infrared0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star6 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	Star8 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star8)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
)
(:goal (and
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 infrared3)
	(have_image Phenomenon13 infrared0)
	(have_image Phenomenon14 infrared3)
	(have_image Planet15 infrared3)
	(have_image Star16 thermograph2)
	(have_image Phenomenon17 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star0 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 star0)
   goals met: 0 of 7
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon14 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon14 instrument4 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite1 phenomenon12 instrument4 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon13 instrument0 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 3 of 7
13. (turn_to satellite1 phenomenon17 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 7
14. (take_image satellite1 phenomenon17 instrument4 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 4 of 7
15. (turn_to satellite1 planet11 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet11)
   goals met: 4 of 7
16. (take_image satellite1 planet11 instrument4 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 5 of 7
17. (turn_to satellite1 planet15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet15)
   goals met: 5 of 7
18. (take_image satellite1 planet15 instrument4 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 6 of 7
19. (turn_to satellite1 star16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star16)
   goals met: 6 of 7
20. (take_image satellite1 star16 instrument4 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 7 of 7
